import { EmotionCategory } from '@/types'

// 中文版情感词汇
export const emotionCategories: EmotionCategory[] = [
  {
    name: '万念俱灰',
    emotions: [
    '无聊', '不能赢', '粗心大意', '冷淡', '停滞', '被打败', '沮丧',
    '泄气', '凄惨', '绝望', '气短', '幻想破灭', '死定了', '精疲力竭', '失败',
    '被遗忘的', '没出息', '放弃',  '没有希望', '没有幽默感', '我不行',
    '我不在乎', '我没有价值', '漫不经心', '优柔寡断', '没有存在感', '太晚了',
    '懒惰', '再等等吧', '无精打采', '失败者','消极', '麻木', '击溃',
    '无能', '认命', '震惊', '魂不守舍', '神志不清', '停滞不前', '太累',
    '冷酷无情', '漫无目的', '没用', '模糊不清', '废物', '有什么用呢', '为什么要试呢',
    '不值得'
    ]
    },
    {
      name: '悲苦',
      emotions: [
      '被遗弃', '被羞辱', '被控告', '极度痛苦', '丢脸', '被背叛', '忧郁', '被欺骗',
      '绝望', '失望', '心烦意乱', '尴尬的', '被忘掉', '愧疚的', '心碎的', '头痛',
      '沮丧', '无助的', '受伤', '要是……就好了', '被忽视的', '不够', '伤心欲绝',
      '不公平', '被遗忘', '极度渴望', '损失', '哀愁', '被误解', '哀悼、', '被忽略',
      '没人关心我', '没人爱我', '乡愁', '错失', '遗憾', '可怜的我', '后悔', '被拒绝',
      '懊悔', '悲哀', '悲伤', '让人落泪的', '被精神折磨', '被虐待', '不开心',
      '不被爱', '没人要', '脆弱', '为什么是我', '受伤的'
      ]
      },
  {
    name: '恐惧',
    emotions: [
    '焦虑', '不安', '小心谨慎', '又冷又黏又湿', '胆小怯懦', '自我防卫的', '不信任',
    '怀疑', '惧怕', '尴尬的', '逃避', '预感的', '狂乱的', '犹豫不决', '惊骇的',
    '歇斯底里', '拘束的', '不理智的', '恶心', '紧张', '恐慌', '麻痹的', '偏执狂',
    '被吓到的', '偷偷摸摸', '不可靠', '羞涩', '怀疑的', '怯场', '迷信的', '多疑的',
    '简短生硬', '被吓坏的', '被威胁的', '羞怯', '陷入困境', '迟疑不决', '心神不宁',
    '容易受伤的', '想要……', '逃避', '小心翼翼', '担心'
    ]
    },
    {
      name: '贪求',
      emotions: [
      '放弃', '预期', '冷酷无情', '等不了', '冲动', '渴求', '苛求的', '狡诈的',
      '被驱使的', '嫉妒', '剥削', '过分迷恋', '暴怒', '失意的', '贪吃暴食的', '贪婪的',
      '囤积', '饥饿', '我想……', '不耐烦', '好色的', '淫荡的', '操纵别人',
      '吝啬的', '一定要得到……', '从来不满足', '从来不满意', '毫无察觉的',
      '着迷的', '溺爱娇纵', '占有欲强的', '掠夺成性的', '固执己见', '鲁莽', '残忍的',
      '诡计多端', '自私的', '如饥似渴', '放纵的'
      ]
      },
      {
        name: '愤怒',
        emotions: [
        '伤人感情的', '好斗的', '被惹恼的', '好辩的', '好战的', '(怒火)激烈', '令人恐惧的', '刻薄的',
        '挑衅的', '苛求的', '毁灭性的', '嫌恶', '脾气暴躁', '凶猛的', '泄气的', '气愤',
        '狂怒的', '严厉', '憎恨', '敌意', '不耐烦', '愤愤不平', '生气', '妒忌',
        '怒气冲冲', '疯狂', '卑鄙', '残忍', '凶残的', '义愤填膺', '坏脾气', '一意孤行',
        '叛逆的', '怨恨', '顽固', '抵制', '粗鲁', '野蛮', '冲突激化', '怒气冲天',
        '五内俱焚', '怀恨在心', '钢铁般的', '着急', '倔强', '愠怒', '复仇心切', '邪恶',
        '暴力', '易爆发的', '恶劣的', '任性的'
        ]
        },
  
  
    {
      name: '自尊自傲',
      emotions: [
      '无疵可寻', '超然离群', '自负', '固执己见', '无聊', '聪明', '封闭的', '沾沾自喜',
      '逞能', '轻蔑的', '酷', '挑剔的', '鄙弃', '傲慢专断', '假谦卑', '虚假美德',
      '扬扬得意', '傲慢', '自以为是', '虚伪', '冷冰冰地', '孤僻的', '批判性的', '自称无所不知的',
      '心胸狭隘', '永远不会错', '武断', '盛气凌人', '神气十足', '偏颇的', '放肆', '自以为公正的',
      '刚直不屈', '自恋的', '自鸣得意', '自私', '自命不凡', '势利眼', '独特', '被宠坏的',
      '禁欲主义', '顽固不化', '自高自大', '优越感', '强硬不妥协', '无感觉的', '不宽恕的', '不屈服的',
      '爱慕虚荣'
      ]
      }
] 