import { EmotionCategory } from '@/types'

export const emotionCategories: EmotionCategory[] = [
  {
    name: '万念俱灰',
    emotions: [
      '累了', '懒惰', '心情大坏', '低落', '虚无感', '心如死灰', '低潮',
      '空虚', '彷徨无措', '没有希望', '困惑', '愚昧', '没出路', '无力',
      '灰心', '无可救药', '我不好', '我不在乎', '我无所谓', '懒散',
      '死气沉沉', '没有感觉', '太累了', '消极', '冷漠', '不够重要',
      '无能为力', '难过', '停滞不前', '没有目的', '混乱不清', '绝望',
      '没什么用处', '为什么要努力呢'
    ]
  },
  {
    name: '悲苦',
    emotions: [
      '虚无感', '伤心', '抱怨', '责备', '绝望', '沮丧', '悲哀', '内疚',
      '困惑', '受伤', '心痛', '委屈', '苦恼', '无力', '疲惫', '要是...多好',
      '虚弱感', '伤心欲绝', '不公平', '消极', '悲伤', '后悔', '疲乏痛苦',
      '没人在乎我', '没人爱我', '懊悔', '可怜', '我好可怜', '挫败',
      '创伤', '没有人理解', '疲不欲生', '不开心', '不受爱', '多余的',
      '没人要', '为什么是我'
    ]
  },
  {
    name: '恐惧',
    emotions: [
      '焦虑', '担忧', '不安', '小心翼翼', '猜疑', '惊慌', '不信任',
      '紧张', '寂寞的', '迷茫的', '不稳的预感', '狂躁', '猜疑不安',
      '惊骇', '极度忧虑', '无望', '没有安全感', '不熟悉的', '担心',
      '纠结', '多疑', '黯淡的', '倦怠', '忧忧虑虑', '不可靠', '尴尬',
      '惊恐', '陷入困境', '不明确', '心中不安', '不自在', '不舒服',
      '害怕受伤', '心怦怦', '小心翼翼'
    ]
  },
  {
    name: '贪求',
    emotions: [
      '挫折', '期待', '低潮', '自卑', '愤怒', '苛刻', '狂躁',
      '愤怒的', '寂寞', '过度积极', '困扰','焦躁', '占有欲', 
      '控制别人', '必须拥有', '什么都不够','不满足',
      '疑虑', '任性','无情的', '诱惑', '自私', 
    ]
  }
] 